In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({ 'Veri': [ '1987_E_ABD _1', '1990?_E_ING_1', '1992_K_ABD_2', '1970?_E_ IT_1', '1985_K_I T_2' ]})

In [3]:
df

            Veri
0  1987_E_ABD _1
1  1990?_E_ING_1
2   1992_K_ABD_2
3  1970?_E_ IT_1
4   1985_K_I T_2

In [8]:
df["Veri"].str.split("_")

0    [1987, E, ABD , 1]
1    [1990?, E, ING, 1]
2     [1992, K, ABD, 2]
3    [1970?, E,  IT, 1]
4     [1985, K, I T, 2]
Name: Veri, dtype: object

In [12]:
df = df["Veri"].str.split("_", expand=True) 
df.columns = ["Yıl", "Cinsiyet", "Ülke", "Çocuk Sayısı"]

In [20]:
df

     Yıl Cinsiyet  Ülke Çocuk Sayısı
0   1987        E  ABD             1
1  1990?        E   ING            1
2   1992        K   ABD            2
3  1970?        E    IT            1
4   1985        K   I T            2

In [29]:
df["Yıl"] = df["Yıl"].str.replace("?", "") # ? karakterlerini silmek için

In [24]:
df["Yıl"]

0    1987
1    1990
2    1992
3    1970
4    1985
Name: Yıl, dtype: object

In [26]:
df["Ülke"] = df["Ülke"].str.replace(" ", "") #boşlukları silmek için

In [27]:
df["Ülke"]

0    ABD
1    ING
2    ABD
3     IT
4     IT
Name: Ülke, dtype: object

In [30]:
df

    Yıl Cinsiyet Ülke Çocuk Sayısı
0  1987        E  ABD            1
1  1990        E  ING            1
2  1992        K  ABD            2
3  1970        E   IT            1
4  1985        K   IT            2